Enums/ОДМ_СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОДМ_СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОДМ_РегламентныеЗадания/Ext/Module.bsl
Процедура ОДМ_ОбработкаЗадач() Экспорт
	
	ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОДМ_ОбработкаЗадач);
	
	//TODO: режем на кучу фоновых заданий по обработке разных функциональностей,
	//все что ниже к полному рефакторингу
	
	//FIXME: плохой роутер - связать
	ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗаданий_Запросы",		,	"ОбработкаЗаданий_Запросы");
	ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗаданий_ЗаписьОбъектов",	,	"ОбработкаЗаданий_ЗаписьОбъектов");
	ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗаданий_Invoke",		,	"ОбработкаЗаданий_Invoke");
	ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗаданий_InvokeОтправить",	,	"ОбработкаЗаданий_InvokeОтправить");
	//<-
	
	ОДМ_ОбменДанными.ОтправитьДанныеВБазыПолучателей();
	ОДМ_ОбменДанными.СоздатьЭлементыСправочникаИзЗадач();
	ОДМ_ОбменДанными.ПолучитьГУИДИзВнешнейБазы();
	
КонецПроцедуры

Процедура ОДМ_ОбработкаУстаревшихЗадач() Экспорт
	
	ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОДМ_ОбработкаУстаревшихЗадач);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.ДатаСоздания < &ДатаСоздания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.ДатаСоздания >= &ДатаСоздания
	                      |	И т.Попытка >= &Попытка
	                      |	И т.Статус В(&АктивныеСтатусы)");
	Запрос.УстановитьПараметр("ДатаСоздания",		ДатаОчисткиЗадач());
	Запрос.УстановитьПараметр("Попытка",			КоличествоПопытокНаЗадачу());
	Запрос.УстановитьПараметр("АктивныеСтатусы",	Перечисления.ОДМ_СтатусыЗадач.АктивныеСтатусы());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ЗадачиСтарогоПериода = РезультатЗапроса[0].Выбрать();
	Пока ЗадачиСтарогоПериода.Следующий() Цикл
		Запись = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьМенеджерЗаписи();
		Запись.Идентификатор = ЗадачиСтарогоПериода.Идентификатор;
		Запись.Удалить();
	КонецЦикла;
	
	ЗадачиПревысившиеЛимитПопыток = РезультатЗапроса[1].Выбрать();
	Пока ЗадачиПревысившиеЛимитПопыток.Следующий() Цикл
		Запись = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьМенеджерЗаписи();
		Запись.Идентификатор = ЗадачиПревысившиеЛимитПопыток.Идентификатор;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Статус = Перечисления.ОДМ_СтатусыЗадач.Ошибка;
			Запись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

//FIXME: требуется унификация - делаем примерно одно и тоже

Процедура ОбработкаЗаданий_Запросы() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.Метод = &Метод
	                      |	И т.Статус В (&АктивныеСтатусы)
	                      |	И т.Попытка < &Попытка");
	Запрос.Параметры.Вставить("Метод",				"query");
	Запрос.Параметры.Вставить("АктивныеСтатусы",	Перечисления.ОДМ_СтатусыЗадач.АктивныеСтатусы());
	Запрос.Параметры.Вставить("Попытка",			КоличествоПопытокНаЗадачу());
	Выборка = Запрос.Выполнить().Выбрать();
	
	//вставить проверку, что бы фоновых заданий не было больше X
	Пока Выборка.Следующий() Цикл
		ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗадания_ВыполнитьЗапрос", Выборка.Идентификатор, Выборка.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры // СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаЗаданий_ЗаписьОбъектов() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.Метод = &Метод
	                      |	И т.Статус В (&АктивныеСтатусы)
	                      |	И т.Попытка < &Попытка");
	Запрос.Параметры.Вставить("Метод",				"objectPOST");
	Запрос.Параметры.Вставить("АктивныеСтатусы",	Перечисления.ОДМ_СтатусыЗадач.АктивныеСтатусы());
	Запрос.Параметры.Вставить("Попытка",			КоличествоПопытокНаЗадачу());
	Выборка = Запрос.Выполнить().Выбрать();
	
	//вставить проверку, что бы фоновых заданий не было больше X
	Пока Выборка.Следующий() Цикл
		ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗадания_ВыполнитьСериализациюОбъекта", Выборка.Идентификатор, Выборка.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаданий_Invoke() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.Метод = &Метод
	                      |	И т.Статус В (&АктивныеСтатусы)
	                      |	И т.Попытка < &Попытка");
	Запрос.Параметры.Вставить("Метод",              "invoke");
	Запрос.Параметры.Вставить("АктивныеСтатусы",    Перечисления.ОДМ_СтатусыЗадач.АктивныеСтатусы());
	Запрос.Параметры.Вставить("Попытка",            КоличествоПопытокНаЗадачу());
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ФоновыеЗадания.Выполнить("ОДМ_РегламентныеЗадания.ОбработкаЗадания_ВыполнитьInvoke",
			Выборка.Идентификатор, Выборка.Идентификатор);
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗадания_ВыполнитьЗапрос(Знач Идентификатор) Экспорт
	
	Задача = РегистрыСведений.ОДМ_ЗадачиОбмена.ДанныеЗадачи(Идентификатор);
	ОДМ_ОбменДанными.ВыполнитьЗапрос(Задача);
	
КонецПроцедуры

Процедура ОбработкаЗадания_ВыполнитьСериализациюОбъекта(Знач Идентификатор) Экспорт
	
	Задача = РегистрыСведений.ОДМ_ЗадачиОбмена.ДанныеЗадачи(Идентификатор);
	ОДМ_ОбменДанными.ЗаписатьОбъект(Задача);
	
КонецПроцедуры

Процедура ОбработкаЗадания_ВыполнитьInvoke(Знач Идентификатор) Экспорт

	Задача = РегистрыСведений.ОДМ_ЗадачиОбмена.ДанныеЗадачи(Идентификатор);
	ОДМ_ОбменДанными.ВыполнитьПоШаблону(Задача);
	
	// Переиспользуемая задача — возвращаем в очередь только после УСПЕШНОГО выполнения
	Если Перечисления.ОДМ_СтатусыЗадач.ЭтоЗавершенныйСтатус(Задача.Статус)
	   И Задача.Параметры.Свойство("Переиспользуемое")
	   И Задача.Параметры.Переиспользуемое = Истина Тогда
		Задача.Статус  = Перечисления.ОДМ_СтатусыЗадач.Подготовлен;
		Задача.Попытка = 0;
		Задача.Ошибка  = "";
		РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(Задача);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаданий_InvokeОтправить() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Идентификатор КАК Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.ОДМ_ЗадачиОбмена КАК т
	                      |ГДЕ
	                      |	т.Метод = &Метод
	                      |	И т.Статус В (&АктивныеСтатусы)
	                      |	И т.Попытка < &Попытка");
	Запрос.Параметры.Вставить("Метод",              "invokeОтправить");
	Запрос.Параметры.Вставить("АктивныеСтатусы",    Перечисления.ОДМ_СтатусыЗадач.АктивныеСтатусы());
	Запрос.Параметры.Вставить("Попытка",            КоличествоПопытокНаЗадачу());
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ФоновыеЗадания.Выполнить(
			"ОДМ_РегламентныеЗадания.ОбработкаЗадания_ВыполнитьInvokeОтправить",
			Выборка.Идентификатор, Выборка.Идентификатор);
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗадания_ВыполнитьInvokeОтправить(Знач Идентификатор) Экспорт

	Задача = РегистрыСведений.ОДМ_ЗадачиОбмена.ДанныеЗадачи(Идентификатор);
	ПараметрыЗадачи = Задача.Параметры;

	ВнешнийИнтерфейс = ОДМ_ОбменДанными.Конструктор_ВнешнийИнтерфейс();

	// Заполняем параметры подключения.
	// Старый путь (из ДопПараметры) — не трогаем, работает через условие ниже.
	Если ПараметрыЗадачи.Свойство("АдресСервера") Тогда
		ВнешнийИнтерфейс.АдресСервера = ПараметрыЗадачи.АдресСервера;
		ВнешнийИнтерфейс.Порт         = ПараметрыЗадачи.Порт;
		ВнешнийИнтерфейс.Логин        = ПараметрыЗадачи.Логин;
		ВнешнийИнтерфейс.Пароль       = ПараметрыЗадачи.Пароль;
	КонецЕсли;

	// Имя базы всегда из параметров задачи
	ВнешнийИнтерфейс.ИмяБазы = ПараметрыЗадачи.БазаПолучатель;

	Попытка
		РезультатПодключения = ВнешнийИнтерфейс.УстановитьХТТПСоединение();
		Если НЕ РезультатПодключения.Успех Тогда
			ВызватьИсключение РезультатПодключения.ДополнительнаяИнформация;
		КонецЕсли;

		// Формируем тело: {"Шаблон": Код, ...Параметры}
		ТелоInvoke = Новый Структура;
		ТелоInvoke.Вставить("Шаблон", ПараметрыЗадачи.Шаблон);

		Если ПараметрыЗадачи.Свойство("Параметры") Тогда
			Для Каждого КлючИЗначение Из ПараметрыЗадачи.Параметры Цикл
				ТелоInvoke.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;
		КонецЕсли;

		Ответ = ВнешнийИнтерфейс.ОтправитьInvokeНаСервер(ТелоInvoke);

		// Переиспользуемая задача — возвращаем в очередь
		Если ПараметрыЗадачи.Свойство("Переиспользуемое")
		   И ПараметрыЗадачи.Переиспользуемое = Истина Тогда
			Задача.Статус  = Перечисления.ОДМ_СтатусыЗадач.Подготовлен;
			Задача.Попытка = 0;
			Задача.Ошибка  = "";
		Иначе
			Задача.Статус = Перечисления.ОДМ_СтатусыЗадач.Выполнен;
		КонецЕсли;
		Задача.Результат    = Ответ;
		Задача.МоментФиниша = ТекущаяДатаСеанса();

	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОДМ_ОбменДанными.ОбработатьОшибкуЗадачиОбмена(Задача, ТекстОшибки);
	КонецПопытки;

	РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(Задача);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КоличествоПопытокНаЗадачу() Экспорт
	
	Возврат 3;
	
КонецФункции

Функция ДатаОчисткиЗадач()
	
	Возврат ТекущаяДатаСеанса() - 30*24*60*60;
	
КонецФункции

#Область РазныеОбертки

Процедура ПриНачалеВыполненияРегламентногоЗадания(Знач РегламентноеЗадание)
	
	ОбщийМодуль_ОбщегоНазначения = ОДМ_ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначения");
	Если НЕ ОбщийМодуль_ОбщегоНазначения = Неопределено Тогда
		ОбщийМодуль_ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // РазныеОбертки

#КонецОбласти // СлужебныеПроцедурыИФункции
